<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="Untitled-2.html">
   
    <title>Document</title>
</head>
<body>
    <script>
        $('button.on').on('click',function(){

        $('h1').hide()
        })


let a = prompt('введите ЦИФРУ. 1-Никита, 2-Богдан, 3-Лиза')
if ( a =='1'){
    alert('Поздравляем! Вы выбрали Никиту!! Его характеристики: сила-80ед. интелект-(-5ед.) ловкость-30ед. ')
}

else if (a == '2'){
alert('Поздравляем! Вы выбрали Богдан!! Его характеристики: сила-30ед. интелект-4ед. ловкость-90ед.')
} 
else if (a == '3'){
alert('Поздравляем! Вы выбрали Лизу!! Его характеристики: сила-70ед. интелект-90ед. ловкость-10ед.')
} 
else if (a == ''){
    alert('ты тупой?')
}
else {
    alert('ты тупой.')
}
let s = prompt ('Ваш персонаж проснулся в странном месте.. Тут пахнет сыростью, а с потолка течёт непонятная жидкость. Вы лежите на обоссаном матрасе. Что Вы сделаете? 1-осмотритесь, 2-притворитесь мёртвым, 3-встать и начать бегать')

if ( s =='1'){
    alert('Вы встали и осмотрели стены. Они были покрыты штукатуркой, и не аккуратно уложеным кирпичом. Около матраса лежала бумажка. Поднять? (1-да, 2-нет)')
}
else if (s == '2'){
alert('Вы легли в произвольной позе на матрас и закрыли глаза. Ничего не произошло.')
} 
else if (s == '3'){
alert('Вы встали и начали бегать по маленькой команте, пока вы не ударились об стену. Подняв глаза, вы поняли, это дверь! Открыть?')
} 
else if (s == ''){
    alert('НЕ ТУПИ')
}
else {
    alert('ТЫ ЗАБАНЕН!!!!!')
}



          </script>
    
</body>
</html>
